program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3402.3.2"}, {"coremlc-version", "3402.4.1"}, {"coremltools-component-tensorflow", "2.12.0"}, {"coremltools-version", "8.2"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 256, 256]> input_1) {
            tensor<fp32, []> input_1__scaled___y_0 = const()[name = tensor<string, []>("input_1__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 256, 256]> input_1__scaled__ = mul(x = input_1, y = input_1__scaled___y_0)[name = tensor<string, []>("input_1__scaled__")];
            tensor<string, []> model_Conv1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_Conv1_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_Conv1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_Conv1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_Conv1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_Conv1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_Conv1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_Conv1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_Conv1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_Conv1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<string, []> input_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [32, 3, 3, 3]> const_4_to_fp16 = const()[name = tensor<string, []>("const_4_to_fp16"), val = tensor<fp16, [32, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> const_5_to_fp16 = const()[name = tensor<string, []>("const_5_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1856)))];
            tensor<fp16, [1, 3, 256, 256]> input_1_to_fp16 = cast(dtype = input_1_to_fp16_dtype_0, x = input_1__scaled__)[name = tensor<string, []>("cast_57")];
            tensor<fp16, [1, 32, 128, 128]> model_bn_Conv1_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_5_to_fp16, dilations = model_Conv1_Conv2Dx_dilations_0, groups = model_Conv1_Conv2Dx_groups_0, pad = model_Conv1_Conv2Dx_pad_0, pad_type = model_Conv1_Conv2Dx_pad_type_0, strides = model_Conv1_Conv2Dx_strides_0, weight = const_4_to_fp16, x = input_1_to_fp16)[name = tensor<string, []>("model_bn_Conv1_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 32, 128, 128]> model_Conv1_relu_Relu6_cast_fp16 = relu6(x = model_bn_Conv1_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_Conv1_relu_Relu6_cast_fp16")];
            tensor<string, []> model_expanded_conv_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_expanded_conv_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 3, 3]> const_6_to_fp16 = const()[name = tensor<string, []>("const_6_to_fp16"), val = tensor<fp16, [32, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1984)))];
            tensor<fp16, [32]> const_7_to_fp16 = const()[name = tensor<string, []>("const_7_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2624)))];
            tensor<fp16, [1, 32, 128, 128]> model_expanded_conv_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_7_to_fp16, dilations = model_expanded_conv_depthwise_depthwisex_dilations_0, groups = model_expanded_conv_depthwise_depthwisex_groups_0, pad = model_expanded_conv_depthwise_depthwisex_pad_0, pad_type = model_expanded_conv_depthwise_depthwisex_pad_type_0, strides = model_expanded_conv_depthwise_depthwisex_strides_0, weight = const_6_to_fp16, x = model_Conv1_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_expanded_conv_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 32, 128, 128]> model_expanded_conv_depthwise_relu_Relu6_cast_fp16 = relu6(x = model_expanded_conv_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_expanded_conv_depthwise_relu_Relu6_cast_fp16")];
            tensor<string, []> model_expanded_conv_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_expanded_conv_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 32, 1, 1]> const_8_to_fp16 = const()[name = tensor<string, []>("const_8_to_fp16"), val = tensor<fp16, [16, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2752)))];
            tensor<fp16, [16]> const_9_to_fp16 = const()[name = tensor<string, []>("const_9_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3840)))];
            tensor<fp16, [1, 16, 128, 128]> model_expanded_conv_project_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_9_to_fp16, dilations = model_expanded_conv_project_Conv2Dx_dilations_0, groups = model_expanded_conv_project_Conv2Dx_groups_0, pad = model_expanded_conv_project_Conv2Dx_pad_0, pad_type = model_expanded_conv_project_Conv2Dx_pad_type_0, strides = model_expanded_conv_project_Conv2Dx_strides_0, weight = const_8_to_fp16, x = model_expanded_conv_depthwise_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_expanded_conv_project_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<string, []> model_block_1_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_1_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_1_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_1_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_1_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_1_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_1_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_1_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_1_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_1_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [96, 16, 1, 1]> const_10_to_fp16 = const()[name = tensor<string, []>("const_10_to_fp16"), val = tensor<fp16, [96, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3968)))];
            tensor<fp16, [96]> const_11_to_fp16 = const()[name = tensor<string, []>("const_11_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7104)))];
            tensor<fp16, [1, 96, 128, 128]> model_block_1_expand_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_11_to_fp16, dilations = model_block_1_expand_Conv2Dx_dilations_0, groups = model_block_1_expand_Conv2Dx_groups_0, pad = model_block_1_expand_Conv2Dx_pad_0, pad_type = model_block_1_expand_Conv2Dx_pad_type_0, strides = model_block_1_expand_Conv2Dx_strides_0, weight = const_10_to_fp16, x = model_expanded_conv_project_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_1_expand_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 96, 128, 128]> model_block_1_expand_relu_Relu6_cast_fp16 = relu6(x = model_block_1_expand_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_1_expand_relu_Relu6_cast_fp16")];
            tensor<string, []> pad_0_mode_0 = const()[name = tensor<string, []>("pad_0_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_4_pad_0 = const()[name = tensor<string, []>("pad_4_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 96, 129, 129]> pad_4_cast_fp16 = pad(constant_val = const_0_to_fp16, mode = pad_0_mode_0, pad = pad_4_pad_0, x = model_block_1_expand_relu_Relu6_cast_fp16)[name = tensor<string, []>("pad_4_cast_fp16")];
            tensor<string, []> model_block_1_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_block_1_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_block_1_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_block_1_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_block_1_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_block_1_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_1_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_block_1_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(96)];
            tensor<int32, [4]> model_block_1_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_block_1_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [96, 1, 3, 3]> const_12_to_fp16 = const()[name = tensor<string, []>("const_12_to_fp16"), val = tensor<fp16, [96, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7360)))];
            tensor<fp16, [96]> const_13_to_fp16 = const()[name = tensor<string, []>("const_13_to_fp16"), val = tensor<fp16, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9152)))];
            tensor<fp16, [1, 96, 64, 64]> model_block_1_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_13_to_fp16, dilations = model_block_1_depthwise_depthwisex_dilations_0, groups = model_block_1_depthwise_depthwisex_groups_0, pad = model_block_1_depthwise_depthwisex_pad_0, pad_type = model_block_1_depthwise_depthwisex_pad_type_0, strides = model_block_1_depthwise_depthwisex_strides_0, weight = const_12_to_fp16, x = pad_4_cast_fp16)[name = tensor<string, []>("model_block_1_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 96, 64, 64]> model_block_1_depthwise_relu_Relu6_cast_fp16 = relu6(x = model_block_1_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_1_depthwise_relu_Relu6_cast_fp16")];
            tensor<string, []> model_block_1_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_1_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_1_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_1_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_1_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_1_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_1_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_1_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_1_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_1_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 96, 1, 1]> const_14_to_fp16 = const()[name = tensor<string, []>("const_14_to_fp16"), val = tensor<fp16, [24, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9408)))];
            tensor<fp16, [24]> const_15_to_fp16 = const()[name = tensor<string, []>("const_15_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14080)))];
            tensor<fp16, [1, 24, 64, 64]> model_block_1_project_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_15_to_fp16, dilations = model_block_1_project_Conv2Dx_dilations_0, groups = model_block_1_project_Conv2Dx_groups_0, pad = model_block_1_project_Conv2Dx_pad_0, pad_type = model_block_1_project_Conv2Dx_pad_type_0, strides = model_block_1_project_Conv2Dx_strides_0, weight = const_14_to_fp16, x = model_block_1_depthwise_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_block_1_project_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<string, []> model_block_2_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_2_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_2_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_2_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_2_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_2_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_2_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_2_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_2_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_2_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [144, 24, 1, 1]> const_16_to_fp16 = const()[name = tensor<string, []>("const_16_to_fp16"), val = tensor<fp16, [144, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14208)))];
            tensor<fp16, [144]> const_17_to_fp16 = const()[name = tensor<string, []>("const_17_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21184)))];
            tensor<fp16, [1, 144, 64, 64]> model_block_2_expand_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_17_to_fp16, dilations = model_block_2_expand_Conv2Dx_dilations_0, groups = model_block_2_expand_Conv2Dx_groups_0, pad = model_block_2_expand_Conv2Dx_pad_0, pad_type = model_block_2_expand_Conv2Dx_pad_type_0, strides = model_block_2_expand_Conv2Dx_strides_0, weight = const_16_to_fp16, x = model_block_1_project_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_2_expand_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 144, 64, 64]> model_block_2_expand_relu_Relu6_cast_fp16 = relu6(x = model_block_2_expand_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_2_expand_relu_Relu6_cast_fp16")];
            tensor<string, []> model_block_2_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_block_2_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_2_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_block_2_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_2_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_block_2_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_2_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_block_2_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(144)];
            tensor<int32, [4]> model_block_2_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_block_2_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [144, 1, 3, 3]> const_18_to_fp16 = const()[name = tensor<string, []>("const_18_to_fp16"), val = tensor<fp16, [144, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21568)))];
            tensor<fp16, [144]> const_19_to_fp16 = const()[name = tensor<string, []>("const_19_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24256)))];
            tensor<fp16, [1, 144, 64, 64]> model_block_2_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_19_to_fp16, dilations = model_block_2_depthwise_depthwisex_dilations_0, groups = model_block_2_depthwise_depthwisex_groups_0, pad = model_block_2_depthwise_depthwisex_pad_0, pad_type = model_block_2_depthwise_depthwisex_pad_type_0, strides = model_block_2_depthwise_depthwisex_strides_0, weight = const_18_to_fp16, x = model_block_2_expand_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_block_2_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 144, 64, 64]> model_block_2_depthwise_relu_Relu6_cast_fp16 = relu6(x = model_block_2_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_2_depthwise_relu_Relu6_cast_fp16")];
            tensor<string, []> model_block_2_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_2_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_2_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_2_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_2_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_2_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_2_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_2_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_2_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_2_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 144, 1, 1]> const_20_to_fp16 = const()[name = tensor<string, []>("const_20_to_fp16"), val = tensor<fp16, [24, 144, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24640)))];
            tensor<fp16, [24]> const_21_to_fp16 = const()[name = tensor<string, []>("const_21_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31616)))];
            tensor<fp16, [1, 24, 64, 64]> model_block_2_project_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_21_to_fp16, dilations = model_block_2_project_Conv2Dx_dilations_0, groups = model_block_2_project_Conv2Dx_groups_0, pad = model_block_2_project_Conv2Dx_pad_0, pad_type = model_block_2_project_Conv2Dx_pad_type_0, strides = model_block_2_project_Conv2Dx_strides_0, weight = const_20_to_fp16, x = model_block_2_depthwise_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_block_2_project_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 24, 64, 64]> model_block_2_add_add_cast_fp16 = add(x = model_block_1_project_BN_FusedBatchNormV3_nchw_cast_fp16, y = model_block_2_project_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_2_add_add_cast_fp16")];
            tensor<string, []> model_block_3_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_3_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_3_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_3_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_3_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_3_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_3_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_3_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_3_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_3_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [144, 24, 1, 1]> const_22_to_fp16 = const()[name = tensor<string, []>("const_22_to_fp16"), val = tensor<fp16, [144, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(31744)))];
            tensor<fp16, [144]> const_23_to_fp16 = const()[name = tensor<string, []>("const_23_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38720)))];
            tensor<fp16, [1, 144, 64, 64]> model_block_3_expand_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_23_to_fp16, dilations = model_block_3_expand_Conv2Dx_dilations_0, groups = model_block_3_expand_Conv2Dx_groups_0, pad = model_block_3_expand_Conv2Dx_pad_0, pad_type = model_block_3_expand_Conv2Dx_pad_type_0, strides = model_block_3_expand_Conv2Dx_strides_0, weight = const_22_to_fp16, x = model_block_2_add_add_cast_fp16)[name = tensor<string, []>("model_block_3_expand_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 144, 64, 64]> model_block_3_expand_relu_Relu6_cast_fp16 = relu6(x = model_block_3_expand_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_3_expand_relu_Relu6_cast_fp16")];
            tensor<string, []> pad_1_mode_0 = const()[name = tensor<string, []>("pad_1_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_5_pad_0 = const()[name = tensor<string, []>("pad_5_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 144, 65, 65]> pad_5_cast_fp16 = pad(constant_val = const_1_to_fp16, mode = pad_1_mode_0, pad = pad_5_pad_0, x = model_block_3_expand_relu_Relu6_cast_fp16)[name = tensor<string, []>("pad_5_cast_fp16")];
            tensor<string, []> model_block_3_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_block_3_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_block_3_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_block_3_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_block_3_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_block_3_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_3_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_block_3_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(144)];
            tensor<int32, [4]> model_block_3_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_block_3_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [144, 1, 3, 3]> const_24_to_fp16 = const()[name = tensor<string, []>("const_24_to_fp16"), val = tensor<fp16, [144, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39104)))];
            tensor<fp16, [144]> const_25_to_fp16 = const()[name = tensor<string, []>("const_25_to_fp16"), val = tensor<fp16, [144]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(41792)))];
            tensor<fp16, [1, 144, 32, 32]> model_block_3_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_25_to_fp16, dilations = model_block_3_depthwise_depthwisex_dilations_0, groups = model_block_3_depthwise_depthwisex_groups_0, pad = model_block_3_depthwise_depthwisex_pad_0, pad_type = model_block_3_depthwise_depthwisex_pad_type_0, strides = model_block_3_depthwise_depthwisex_strides_0, weight = const_24_to_fp16, x = pad_5_cast_fp16)[name = tensor<string, []>("model_block_3_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 144, 32, 32]> model_block_3_depthwise_relu_Relu6_cast_fp16 = relu6(x = model_block_3_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_3_depthwise_relu_Relu6_cast_fp16")];
            tensor<string, []> model_block_3_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_3_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_3_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_3_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_3_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_3_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_3_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_3_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_3_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_3_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 144, 1, 1]> const_26_to_fp16 = const()[name = tensor<string, []>("const_26_to_fp16"), val = tensor<fp16, [32, 144, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(42176)))];
            tensor<fp16, [32]> const_27_to_fp16 = const()[name = tensor<string, []>("const_27_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51456)))];
            tensor<fp16, [1, 32, 32, 32]> model_block_3_project_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_27_to_fp16, dilations = model_block_3_project_Conv2Dx_dilations_0, groups = model_block_3_project_Conv2Dx_groups_0, pad = model_block_3_project_Conv2Dx_pad_0, pad_type = model_block_3_project_Conv2Dx_pad_type_0, strides = model_block_3_project_Conv2Dx_strides_0, weight = const_26_to_fp16, x = model_block_3_depthwise_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_block_3_project_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<string, []> model_block_4_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_4_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_4_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_4_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_4_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_4_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_4_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_4_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_4_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_4_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 32, 1, 1]> const_28_to_fp16 = const()[name = tensor<string, []>("const_28_to_fp16"), val = tensor<fp16, [192, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(51584)))];
            tensor<fp16, [192]> const_29_to_fp16 = const()[name = tensor<string, []>("const_29_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63936)))];
            tensor<fp16, [1, 192, 32, 32]> model_block_4_expand_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_29_to_fp16, dilations = model_block_4_expand_Conv2Dx_dilations_0, groups = model_block_4_expand_Conv2Dx_groups_0, pad = model_block_4_expand_Conv2Dx_pad_0, pad_type = model_block_4_expand_Conv2Dx_pad_type_0, strides = model_block_4_expand_Conv2Dx_strides_0, weight = const_28_to_fp16, x = model_block_3_project_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_4_expand_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 192, 32, 32]> model_block_4_expand_relu_Relu6_cast_fp16 = relu6(x = model_block_4_expand_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_4_expand_relu_Relu6_cast_fp16")];
            tensor<string, []> model_block_4_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_block_4_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_4_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_block_4_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_4_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_block_4_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_4_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_block_4_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(192)];
            tensor<int32, [4]> model_block_4_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_block_4_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 1, 3, 3]> const_30_to_fp16 = const()[name = tensor<string, []>("const_30_to_fp16"), val = tensor<fp16, [192, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64384)))];
            tensor<fp16, [192]> const_31_to_fp16 = const()[name = tensor<string, []>("const_31_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(67904)))];
            tensor<fp16, [1, 192, 32, 32]> model_block_4_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_31_to_fp16, dilations = model_block_4_depthwise_depthwisex_dilations_0, groups = model_block_4_depthwise_depthwisex_groups_0, pad = model_block_4_depthwise_depthwisex_pad_0, pad_type = model_block_4_depthwise_depthwisex_pad_type_0, strides = model_block_4_depthwise_depthwisex_strides_0, weight = const_30_to_fp16, x = model_block_4_expand_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_block_4_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 192, 32, 32]> model_block_4_depthwise_relu_Relu6_cast_fp16 = relu6(x = model_block_4_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_4_depthwise_relu_Relu6_cast_fp16")];
            tensor<string, []> model_block_4_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_4_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_4_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_4_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_4_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_4_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_4_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_4_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_4_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_4_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 192, 1, 1]> const_32_to_fp16 = const()[name = tensor<string, []>("const_32_to_fp16"), val = tensor<fp16, [32, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(68352)))];
            tensor<fp16, [32]> const_33_to_fp16 = const()[name = tensor<string, []>("const_33_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(80704)))];
            tensor<fp16, [1, 32, 32, 32]> model_block_4_project_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_33_to_fp16, dilations = model_block_4_project_Conv2Dx_dilations_0, groups = model_block_4_project_Conv2Dx_groups_0, pad = model_block_4_project_Conv2Dx_pad_0, pad_type = model_block_4_project_Conv2Dx_pad_type_0, strides = model_block_4_project_Conv2Dx_strides_0, weight = const_32_to_fp16, x = model_block_4_depthwise_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_block_4_project_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 32, 32, 32]> model_block_4_add_add_cast_fp16 = add(x = model_block_3_project_BN_FusedBatchNormV3_nchw_cast_fp16, y = model_block_4_project_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_4_add_add_cast_fp16")];
            tensor<string, []> model_block_5_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_5_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_5_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_5_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_5_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_5_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_5_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_5_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_5_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_5_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 32, 1, 1]> const_34_to_fp16 = const()[name = tensor<string, []>("const_34_to_fp16"), val = tensor<fp16, [192, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(80832)))];
            tensor<fp16, [192]> const_35_to_fp16 = const()[name = tensor<string, []>("const_35_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93184)))];
            tensor<fp16, [1, 192, 32, 32]> model_block_5_expand_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_35_to_fp16, dilations = model_block_5_expand_Conv2Dx_dilations_0, groups = model_block_5_expand_Conv2Dx_groups_0, pad = model_block_5_expand_Conv2Dx_pad_0, pad_type = model_block_5_expand_Conv2Dx_pad_type_0, strides = model_block_5_expand_Conv2Dx_strides_0, weight = const_34_to_fp16, x = model_block_4_add_add_cast_fp16)[name = tensor<string, []>("model_block_5_expand_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 192, 32, 32]> model_block_5_expand_relu_Relu6_cast_fp16 = relu6(x = model_block_5_expand_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_5_expand_relu_Relu6_cast_fp16")];
            tensor<string, []> model_block_5_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_block_5_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_5_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_block_5_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_5_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_block_5_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_5_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_block_5_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(192)];
            tensor<int32, [4]> model_block_5_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_block_5_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 1, 3, 3]> const_36_to_fp16 = const()[name = tensor<string, []>("const_36_to_fp16"), val = tensor<fp16, [192, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(93632)))];
            tensor<fp16, [192]> const_37_to_fp16 = const()[name = tensor<string, []>("const_37_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97152)))];
            tensor<fp16, [1, 192, 32, 32]> model_block_5_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_37_to_fp16, dilations = model_block_5_depthwise_depthwisex_dilations_0, groups = model_block_5_depthwise_depthwisex_groups_0, pad = model_block_5_depthwise_depthwisex_pad_0, pad_type = model_block_5_depthwise_depthwisex_pad_type_0, strides = model_block_5_depthwise_depthwisex_strides_0, weight = const_36_to_fp16, x = model_block_5_expand_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_block_5_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 192, 32, 32]> model_block_5_depthwise_relu_Relu6_cast_fp16 = relu6(x = model_block_5_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_5_depthwise_relu_Relu6_cast_fp16")];
            tensor<string, []> model_block_5_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_5_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_5_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_5_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_5_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_5_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_5_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_5_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_5_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_5_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 192, 1, 1]> const_38_to_fp16 = const()[name = tensor<string, []>("const_38_to_fp16"), val = tensor<fp16, [32, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(97600)))];
            tensor<fp16, [32]> const_39_to_fp16 = const()[name = tensor<string, []>("const_39_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(109952)))];
            tensor<fp16, [1, 32, 32, 32]> model_block_5_project_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_39_to_fp16, dilations = model_block_5_project_Conv2Dx_dilations_0, groups = model_block_5_project_Conv2Dx_groups_0, pad = model_block_5_project_Conv2Dx_pad_0, pad_type = model_block_5_project_Conv2Dx_pad_type_0, strides = model_block_5_project_Conv2Dx_strides_0, weight = const_38_to_fp16, x = model_block_5_depthwise_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_block_5_project_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 32, 32, 32]> model_block_5_add_add_cast_fp16 = add(x = model_block_4_add_add_cast_fp16, y = model_block_5_project_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_5_add_add_cast_fp16")];
            tensor<string, []> model_block_6_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_6_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_6_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_6_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_6_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_6_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_6_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_6_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_6_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_6_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 32, 1, 1]> const_40_to_fp16 = const()[name = tensor<string, []>("const_40_to_fp16"), val = tensor<fp16, [192, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(110080)))];
            tensor<fp16, [192]> const_41_to_fp16 = const()[name = tensor<string, []>("const_41_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(122432)))];
            tensor<fp16, [1, 192, 32, 32]> model_block_6_expand_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_41_to_fp16, dilations = model_block_6_expand_Conv2Dx_dilations_0, groups = model_block_6_expand_Conv2Dx_groups_0, pad = model_block_6_expand_Conv2Dx_pad_0, pad_type = model_block_6_expand_Conv2Dx_pad_type_0, strides = model_block_6_expand_Conv2Dx_strides_0, weight = const_40_to_fp16, x = model_block_5_add_add_cast_fp16)[name = tensor<string, []>("model_block_6_expand_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 192, 32, 32]> model_block_6_expand_relu_Relu6_cast_fp16 = relu6(x = model_block_6_expand_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_6_expand_relu_Relu6_cast_fp16")];
            tensor<string, []> pad_2_mode_0 = const()[name = tensor<string, []>("pad_2_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_6_pad_0 = const()[name = tensor<string, []>("pad_6_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 192, 33, 33]> pad_6_cast_fp16 = pad(constant_val = const_2_to_fp16, mode = pad_2_mode_0, pad = pad_6_pad_0, x = model_block_6_expand_relu_Relu6_cast_fp16)[name = tensor<string, []>("pad_6_cast_fp16")];
            tensor<string, []> model_block_6_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_block_6_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_block_6_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_block_6_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_block_6_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_block_6_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_6_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_block_6_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(192)];
            tensor<int32, [4]> model_block_6_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_block_6_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 1, 3, 3]> const_42_to_fp16 = const()[name = tensor<string, []>("const_42_to_fp16"), val = tensor<fp16, [192, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(122880)))];
            tensor<fp16, [192]> const_43_to_fp16 = const()[name = tensor<string, []>("const_43_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126400)))];
            tensor<fp16, [1, 192, 16, 16]> model_block_6_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_43_to_fp16, dilations = model_block_6_depthwise_depthwisex_dilations_0, groups = model_block_6_depthwise_depthwisex_groups_0, pad = model_block_6_depthwise_depthwisex_pad_0, pad_type = model_block_6_depthwise_depthwisex_pad_type_0, strides = model_block_6_depthwise_depthwisex_strides_0, weight = const_42_to_fp16, x = pad_6_cast_fp16)[name = tensor<string, []>("model_block_6_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 192, 16, 16]> model_block_6_depthwise_relu_Relu6_cast_fp16 = relu6(x = model_block_6_depthwise_BN_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_block_6_depthwise_relu_Relu6_cast_fp16")];
            tensor<string, []> model_block_6_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_6_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_6_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_6_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_6_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_6_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_6_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_6_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_6_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_6_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 192, 1, 1]> const_44_to_fp16 = const()[name = tensor<string, []>("const_44_to_fp16"), val = tensor<fp16, [64, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126848)))];
            tensor<fp16, [64]> const_45_to_fp16 = const()[name = tensor<string, []>("const_45_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(151488)))];
            tensor<fp16, [1, 64, 16, 16]> model_block_6_project_BN_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_45_to_fp16, dilations = model_block_6_project_Conv2Dx_dilations_0, groups = model_block_6_project_Conv2Dx_groups_0, pad = model_block_6_project_Conv2Dx_pad_0, pad_type = model_block_6_project_Conv2Dx_pad_type_0, strides = model_block_6_project_Conv2Dx_strides_0, weight = const_44_to_fp16, x = model_block_6_depthwise_relu_Relu6_cast_fp16)[name = tensor<string, []>("model_block_6_project_BN_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<string, []> model_block_7_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_block_7_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_block_7_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_block_7_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_block_7_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_block_7_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_block_7_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_block_7_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_block_7_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_block_7_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 64, 1, 1]> const_46_to_fp16 = const()[name = tensor<string, []>("const_46_to_fp16"), val = tensor<fp16, [384, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(151680)))];
